
#1
a = 10
b = 20
c = 30
print (a, b, c)


int(input("Введите целое число"))
d = int(input("Введите целое число")) #если запрашиваемое число из множества целых чисел
float(input("Введите число"))
e =  float(input("Введите число")) #если запрашиваемое число из рацональных чисел
input("Введите имя собаки: ")
f = input("Введите имя собаки: ")#строковые данные пишутся без функции str
#2
int(input("Введите время в секундах"))
sec1 = int(input("Введите время в секундах"))
h = int(sec1 % 3600) #часы
min = int(h % 60) #минуты
sec2 = int #остаток деления
print ("чч:мм:сс" {h} : {min} {sec2}.format( "h, "min", "sec"))
#3
int (input ("Введите число"))
n =  int(input ("Введите число"))
sum_n = int(n + (10*n+n) + (100*n + 10*n + n))
#4 Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.
#com: Для начала необходимо определить предел значности числа, тогда можно было бы сравнить цифры

n = int(input "Введите целое положительное число")
while n / 10
a = n % 10
while a <= 9
      repeat

#5
n = input (float('Введите значение выручки'))
m = input (float ('Введите значение издержек'))
if n > m:
    print (str ("Поздравляем, Ваша фирма приносит прибыль!"))
if mw == n
    print (str ("Вы держитесь на плаву, так держать"))
if n < m
    print (str ("Пока ваша фирма приносит убытки, но все лучшее - еще впереди"))
#6
n = input (float ('Введите значения выручки'))
m = input (float ('Введите значение издержек'))
if n > m:
    a = float (n - m) #прибыль
    rent = a % n
s = input (float ("Введите количество сотрудников, работающих в вашей фирме"))
l = a % s
#7
a = int(input ("Результат пробежки, км")) #верхняя граница

b = int (input ("Желаемый результат, км")) #нижняя граница
day = 1
while a < b :
    res.n = int (a + 0.1*a)
    res.d = int (d + 1)

print (res.d)



///



